Parameter '[Caption]' cannot be changed because it is defined by formula '[Formula]'
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId FormulaBasedParameterCannotBeChanged { get; }
  Visual Basic
Public Shared ReadOnly Property FormulaBasedParameterCannotBeChanged As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ FormulaBasedParameterCannotBeChanged {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures FamilyFailures Class
  Autodesk.Revit.DB Namespace